test.yml
config:
  target: 'https://jsonplaceholder.typicode.com'
  phases:
    - duration: 10
      arrivalRate: 0
      rampTo: 20
      name: "Warm up from idle to the target rps in 10 seconds"
    - duration: 40
      arrivalRate: 20
      name: "Sustain the load for 45 seconds"
    - pause: 5
      name: "Cool down for 5 seconds"

scenarios:
  - name: "Get user[7]'s details"
    flow:
      - get:
          url: "/users/7"